---
kind: enumMember
id: F:Autodesk.Revit.DB.LinkedFileStatus.Invalid
enum: Autodesk.Revit.DB.LinkedFileStatus
source: html/410b48f8-2a32-3d54-492c-c9a9fe4030ca.htm
---
# Autodesk.Revit.DB.LinkedFileStatus.Invalid

This value is the uninitialized value for the enum.
 It indicates that the link has not been properly
 initialized.